#### Terraform fmt for main `success`
#### Terraform init for main `success`
#### Terraform validate for main `success`
#### Terraform plan for main `success`

<details><summary>Show plan result for main </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=110]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.debian_12_cloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {
      + content_type   = "iso"
      + datastore_id   = "local"
      + file_name      = "debian_12_cloud_image.img"
      + id             = (known after apply)
      + node_name      = "pve"
      + overwrite      = true
      + size           = (known after apply)
      + upload_timeout = 600
      + url            = "https://cloud.debian.org/images/cloud/bookworm/latest/debian-12-generic-amd64.qcow2"
      + verify         = true
    }

  # proxmox_virtual_environment_vm.dev_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "dev_vm" {
      ~ id                      = "110" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:69:8C:71",
        ] -> (known after apply)
        name                    = "main"
      ~ network_interface_names = [] -> (known after apply)
      + stop_on_destroy         = false
        # (20 unchanged attributes hidden)

      - clone {
          - full    = true -> null
          - retries = 1 -> null
          - vm_id   = 999 -> null # forces replacement
        }

      ~ cpu {
          - flags        = [] -> null
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          + file_id           = (known after apply) # forces replacement
          ~ path_in_datastore = "vm-110-disk-0" -> (known after apply)
          ~ ssd               = false -> true
            # (6 unchanged attributes hidden)
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

          ~ dns {
              - servers = [] -> null
                # (1 unchanged attribute hidden)
            }

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "BC:24:11:69:8C:71" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with proxmox_virtual_environment_vm.dev_vm,
  on debian.tf line 107, in resource "proxmox_virtual_environment_vm" "dev_vm":
 107:       server = "192.168.${var.tag}.1"

The `server` attribute is deprecated and will be removed in a future release.
Please use the `servers` attribute instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*